//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"BUILDING_ENTITY_STORE"="Utfører trinn %d av %d: Bygger entitetsarkivet";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_BOOTSTRAP_DATABASE"="Utfører trinn %d av %d: Oppretter bootstrap-database";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_REQUEST_QUEUE_DATABASE"="Utfører trinn %d av %d: Oppretter database for forespørselskø";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - received bytes; 2nd %s - total bytes.
"DOWNLOADING_ENTITY_STORE"="Utfører trinn %d av %d: Laster ned entitetsarkiv. Har mottatt %s av %s hittil.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ERASING_EXPIRED_REQUESTS"="Utfører trinn %d av %d: Sletter utløpte forespørsler";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"LOADING_METADATA"="Utfører trinn %d av %d: Laster metadataene";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_REQUEST_QUEUE_MERGE"="Utfører trinn %d av %d: Slår sammen forespørselskøer";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_TRANSACTION_MERGE"="Utfører trinn %d av %d: Slår sammen transaksjoner";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_CREATE_DELETE_MERGE"="Utfører trinn %d av %d: Oppretter, sletter, slår sammen";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request name; 2nd %s - request url.
"PROCESSING_DEFINING_QUERIES"="Utfører trinn %d av %d: Behandler definerende spørringer %s med %s";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request number; 2nd %s - total request number.
"PROCESSING_REQUESTS"="Utfører trinn %d av %d: Behandler forespørsler. Sender endringsforespørsel %s av %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REAPPLYING_CHANGES"="Utfører trinn %d av %d: Bruker endringer på nytt";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ANALYZING_RECEIVED_DATA"="Utfører trinn %d av %d: Analyserer mottatte data";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - received bytes.
"RECEIVING_DATA_FROM_SERVER"="Utfører trinn %d av %d: Mottar data fra serveren. Har mottatt %s hittil.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REMOVING_DELETED_RELATIONSHIPS"="Utfører trinn %d av %d: Fjerner slettede relasjoner";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. Removing requests that have a custom http header "REMOVE_AFTER_UPLOAD". Note: the header name is a constant, please do not translate.
"REMOVING_REMOVEAFTERUPLOAD_REQUESTS"="Utfører trinn %d av %d: Fjerner forespørsler spesifisert som RemoveAfterUpload";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - sent bytes.
"SENDING_DATA_TO_SERVER"="Utfører trinn %d av %d: Sender data til serveren. Har sendt %s hittil.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_ENTITY_STORE_DATABASE"="Utfører trinn %d av %d: Sender database for entitetsarkiv. Har sendt %s av %s hittil.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_REQUEST_QUEUE_DATABASE"="Utfører trinn %d av %d: Sender database for forespørselskø. Har sendt %s av %s hittil.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"STARTING_COMMUNICATION_WITH_SERVER"="Utfører trinn %d av %d: Starter kommunikasjon med serveren";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"UPLOAD_PREPROCESSING"="Utfører trinn %d av %d: Forbehandler forespørsler før opplasting";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"WAITING_FOR_DOWNLOAD"="Utfører trinn %d av %d: Venter på nedlasting";

